[{"desc":"The Team is all set to launch coupons specifically designed for college students through which you can avail a cash back of flat Rs 200 or Rs 100 while buying the official merchandise or taking part in various events/workshops held in association with the club.Grab your coupon now, as this is only a limited time deal!<p><ul><li> The coupons are priced at 100 and 50. That is, one can buy either Rs 100 coupons or Rs 50 coupons.</li><li> Next comes the concept of redeem value. For example, if you buy a coupon with Rs 100, then you will be liable for a total discount of Rs 200, which is distributed among merchandise + workshop + intra + Two events in Edge. If Mr. X buys a coupon with Rs 100, then when he will buy the official merchandise he will get Rs 30 off on the price, next he will get Rs 110 off on the registration fee of workshop, then comes Intra, there he needs to pay a certain amount of money to participate in all the events he will get Rs 20 off on that, same applies for Edge he will get Rs 20 off on the participation fee on 2 events.</li><li> A total of all the discounts will give a total of Rs 200 i.e 30 + 110 + 20 + 20 + 20 = 200 i.e you are paying us Rs 100 and getting Rs 200 in return.</li><li> The money under various events that has been mentioned in the coupon, is the discount you will get. Like, for merchandise it's mentioned 30, that means while buying the merchandise you will get Rs 30 off.</li><li> Same applies for the coupons valued Rs 50 whose redeem value is Rs 100.</li><li> The ones who will buy the Rs 100 coupons before the Robo War workshop (4th February, 2020), the workshop will be totally free for you. This applies only for the Rs 100 coupons.</li></ul></p><p><b>For further queries contact:-<br>Swarnali:- 9123334065<br>Sharmistha:- 8768078258<b></p>","icName":"","icUrl":"https://firebasestorage.googleapis.com/v0/b/edge-new-a7306.appspot.com/o/banner_items%2Fic_coupons.webp?alt=media&token=99176ea0-a13d-4685-b9a9-a39a247dc9ef","imgName":"","imgUrl":"https://firebasestorage.googleapis.com/v0/b/edge-new-a7306.appspot.com/o/banner_items%2Fcoupons.webp?alt=media&token=8a87c83c-7373-478f-917d-bbc1137e9a62","isMega":"0","name":"Geekonix Coupons","sched":""},{"desc":"<i>Fight smart, be patient and pray<br>-- Charlie from RealSteel.</i><p>If merciless fighting for fame, glory and recognition is your forte, then come forth to join the first ever, one-of-its kind Robo War Workshop in Eastern India presented by members of reputed teams in association with Robokshetra Pvt. Ltd. & Geekonix right here at Techno Main on 4th February.<p>Come join us and master the back-end functionality of how metal crushes metal  in the most glorious battle of Robots!!<br><br><b>The ones who have already paid online for the Robo war workshop, positively send the screenshot of your transaction id,along with your name, college, department and academic year to 8768078258 or 9123334065, otherwise your registration won't be taken into consideration. Also, the ones who will pay in the coming days (for this particular workshop only) must send the screenshots to anyone of the above mentioned numbers. Kindly pass this information to your friends from other colleges too.</b>","icName":"","icUrl":"https://firebasestorage.googleapis.com/v0/b/edge-new-a7306.appspot.com/o/banner_items%2Fic_robowar.webp?alt=media&token=fb383b83-c438-4f5d-8db3-cc312e38fb35","imgName":"","imgUrl":"https://firebasestorage.googleapis.com/v0/b/edge-new-a7306.appspot.com/o/banner_items%2Frobows.webp?alt=media&token=058b7e92-fe16-401f-be86-ad6b331a96b5","isMega":"0","name":"Robowar Workshop","sched":"<d>04/02/20</d><t>01:30pm</t><e>Robowar workshop</e>"},{"desc":"<b>\"If you do one good deed your reward usually is to be set to do another and harder and better one.\"</b><p>With such high spirits, we at EDGE'20 look forward to doing our bit towards the well-being of the society. Be able to give someone moments to cherish and a reason to smile for. EDGE Deeds is an idea, a roadmap towards achieving and justifying our humanitarian goals step by step as everybody cherishes a \"some more\" than a \"something\".","icName":"","icUrl":"","imgName":"edge_deeds","imgUrl":"","isMega":"1","name":"EDGE Deeds","sched":""},{"desc":"To add up to all of the extravaganzas of EDGE, we have the star night. The vibrant life of those few hours, the captivating speeches, pleasant interactions and amusing stage performances usher in an unprecedented medley of excitement and zeal. EDGE Night promises to be a perfect fusion of innovative ideas and enthusiasm.\\n\\nStay tuned for updates.","icName":"","icUrl":"","imgName":"edge_night","imgUrl":"","isMega":"1","name":"EDGE Night","sched":""},{"desc":"<b>\"When all think alike, then no one is thinking.\"</b><br>EDGE Talks promise to be bigger, better and our speakers are ready with their inspiration packed talks, waiting to blow your minds. Because it's not about ideas, it's about making ideas happen! We here aim at holistic experiences and engaging opportunities to be the next generation of change makers. It brings the top-of-the-mind concerns of millennials to the fore, stimulating substantial conversations. As a forum for open expression and the healthy questioning of established ideas and notions.<p>Stay tuned for updates.","icName":"","icUrl":"","imgName":"edge_talks","imgUrl":"","isMega":"1","name":"EDGE Talks","sched":""},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Intra","sched":"<d>06/03/20 - 08/03/20</d><t>2<sup>nd</sup> half</t><e>Intra</e>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Ethical Hacking Workshop","sched":"<d>To be announced.</d>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Collection Drive","sched":"<d>To be announced.</d>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Walkathon","sched":"<d>To be announced.</d>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Visit a Friend","sched":"<d>To be announced.</d>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"Feed Our Friend","sched":"<d>To be announced.</d>"},{"desc":"<b>Details will be updated soon.</b>","icName":"","icUrl":"","imgName":"","imgUrl":"","isMega":"0","name":"EDGE '20","sched":"<d>03/04/20</d><t>All day</t><e>EDGE '20</e><d>04/04/20</d><t>All day</t><e>EDGE '20</e><d>05/04/20</d><t>All day</t><e>EDGE '20</e>"}]
